results/results_old/data/run3/native-db/erik-laptop/quarkus-worker-pool-5000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.583ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.562ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.555ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.552ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.56ms  486.31us   7.27ms   70.73%
    Req/Sec     1.32k   188.20     2.44k    78.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.53ms
 75.000%    1.86ms
 90.000%    2.12ms
 99.000%    2.71ms
 99.900%    5.78ms
 99.990%    6.79ms
 99.999%    7.25ms
100.000%    7.28ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.584     0.000000            1         1.00
       0.980     0.100000        24938         1.11
       1.128     0.200000        50014         1.25
       1.264     0.300000        74839         1.43
       1.397     0.400000        99755         1.67
       1.531     0.500000       124866         2.00
       1.597     0.550000       137356         2.22
       1.662     0.600000       149791         2.50
       1.724     0.650000       162156         2.86
       1.791     0.700000       174725         3.33
       1.858     0.750000       187089         4.00
       1.893     0.775000       193364         4.44
       1.929     0.800000       199501         5.00
       1.969     0.825000       205788         5.71
       2.013     0.850000       212006         6.67
       2.065     0.875000       218370         8.00
       2.093     0.887500       221346         8.89
       2.125     0.900000       224449        10.00
       2.165     0.912500       227713        11.43
       2.207     0.925000       230670        13.33
       2.261     0.937500       233793        16.00
       2.295     0.943750       235367        17.78
       2.333     0.950000       236926        20.00
       2.375     0.956250       238480        22.86
       2.425     0.962500       240042        26.67
       2.481     0.968750       241592        32.00
       2.511     0.971875       242409        35.56
       2.539     0.975000       243138        40.00
       2.571     0.978125       243955        45.71
       2.605     0.981250       244712        53.33
       2.643     0.984375       245516        64.00
       2.661     0.985938       245884        71.11
       2.681     0.987500       246267        80.00
       2.703     0.989062       246680        91.43
       2.727     0.990625       247043       106.67
       2.755     0.992188       247444       128.00
       2.771     0.992969       247640       142.22
       2.789     0.993750       247833       160.00
       2.809     0.994531       248015       182.86
       2.831     0.995313       248216       213.33
       2.865     0.996094       248402       256.00
       2.889     0.996484       248497       284.44
       2.919     0.996875       248597       320.00
       2.971     0.997266       248693       365.71
       3.123     0.997656       248788       426.67
       5.067     0.998047       248885       512.00
       5.231     0.998242       248935       568.89
       5.399     0.998437       248984       640.00
       5.535     0.998633       249032       731.43
       5.679     0.998828       249082       853.33
       5.815     0.999023       249130      1024.00
       5.899     0.999121       249153      1137.78
       5.991     0.999219       249178      1280.00
       6.075     0.999316       249202      1462.86
       6.183     0.999414       249226      1706.67
       6.251     0.999512       249252      2048.00
       6.291     0.999561       249263      2275.56
       6.367     0.999609       249275      2560.00
       6.423     0.999658       249287      2925.71
       6.487     0.999707       249299      3413.33
       6.519     0.999756       249312      4096.00
       6.563     0.999780       249318      4551.11
       6.611     0.999805       249324      5120.00
       6.663     0.999829       249330      5851.43
       6.695     0.999854       249336      6826.67
       6.735     0.999878       249342      8192.00
       6.767     0.999890       249346      9102.22
       6.823     0.999902       249348     10240.00
       6.831     0.999915       249351     11702.86
       6.851     0.999927       249354     13653.33
       6.907     0.999939       249357     16384.00
       6.915     0.999945       249359     18204.44
       6.935     0.999951       249360     20480.00
       6.947     0.999957       249362     23405.71
       7.043     0.999963       249363     27306.67
       7.095     0.999969       249365     32768.00
       7.123     0.999973       249366     36408.89
       7.123     0.999976       249366     40960.00
       7.223     0.999979       249367     46811.43
       7.231     0.999982       249368     54613.33
       7.239     0.999985       249369     65536.00
       7.239     0.999986       249369     72817.78
       7.239     0.999988       249369     81920.00
       7.247     0.999989       249370     93622.86
       7.247     0.999991       249370    109226.67
       7.267     0.999992       249371    131072.00
       7.267     0.999993       249371    145635.56
       7.267     0.999994       249371    163840.00
       7.267     0.999995       249371    187245.71
       7.267     0.999995       249371    218453.33
       7.275     0.999996       249372    262144.00
       7.275     1.000000       249372          inf
#[Mean    =        1.558, StdDeviation   =        0.486]
#[Max     =        7.272, Total count    =       249372]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299741 requests in 1.00m, 48.60MB read
Requests/sec:   4995.59
Transfer/sec:    829.35KB